package com.leetcode.pq;

public class Hello {
/*
*****************************************************************
由于队列的一个重要的作用，就是实现广度优先算法，因此队列经常用来解决树和图中的相关问题。
所以，我们将会在树和图的相关问题中，尝试用队列这种数据结构解决问题。
因此我们可以看到队列一般是与其他数据结构结合使用。大家可以回忆一下，这一点的另一个体现，
也就是优先队列。
*****************************************************************

优先队列01 - 出现频率第k的元素 - 中等 - 347

给定一个非空整形数组，返回出现频率第k的元素。

比如：
给定[1,1,1,2,2,3]，k=2，返回[1,2]。

注意：
* 你可以假设k为有效的值，1 <= k <= 独一元素数量
* 算法时间复杂度必须至少为O(nlogn)。

提示：这里提供三个思路：

1. 扫描一遍统计频率；排序找到前k个出现频率最高的元素 O(nlogn)；
2. 维护优先队列，O(nlogk)
3. 维护优先队列，时间复杂度为(Onlog(n-k))

-----------------------------------------------------------------

优先队列02（链表） - 合并k个有序链表 - 困难 - 23

合并k个有序的链表并返回合成的有序列表。

提示：当k为2时，其实就是经典的归并排序中的归并过程。当这个问题解决后，
我们就自然可以设计出k分归并排序算法了。

-----------------------------------------------------------------
 */
}
